app/Models/Master/MahasiswaModel.php

    public function getMahasiswabyUserId()
    {
        $user_id = user()->id;
        $builder = $this->db->table('mahasiswa');
        $builder->select('*');
        $builder->join('users','users.id = mahasiswa.id_user');
        $builder->where('id_user', $user_id);
        $query = $builder->get();
---
SELECT *
FROM `mahasiswa`
JOIN `users` ON `users`.`id` = `mahasiswa`.`id_user`
WHERE `id_user` = '34'