app/Models/Simlab/AlatLaboratoriumModel.php

    public function getAlatLabBaik($kondisi = 'Baik')
    {
        $builder = $this->db->table('simlab_alat_laboratorium');
        $builder->select('simlab_alat_laboratorium.*, simlab_kategori.*, simlab_ruang_laboratorium.*');
        $builder->join('simlab_kategori', 'simlab_kategori.id_kategori = simlab_alat_laboratorium.id_kategori');
        $builder->join('simlab_ruang_laboratorium', 'simlab_ruang_laboratorium.id_ruang = simlab_alat_laboratorium.id_ruang');
        $builder->where('kondisi', $kondisi);
        $builder->orderBy('nama_kategori', 'ASC');
        $builder->orderBy('nama_alat', 'ASC');
        $builder->orderBy('no_inventaris', 'ASC');
        $builder->orderBy('tanggal_masuk', 'ASC');
        $query = $builder->get();
---
SELECT `simlab_alat_laboratorium`.*, `simlab_kategori`.*, `simlab_ruang_laboratorium`.*
FROM `simlab_alat_laboratorium`
JOIN `simlab_kategori` ON `simlab_kategori`.`id_kategori` = `simlab_alat_laboratorium`.`id_kategori`
JOIN `simlab_ruang_laboratorium` ON `simlab_ruang_laboratorium`.`id_ruang` = `simlab_alat_laboratorium`.`id_ruang`
WHERE `kondisi` = 'Baik'
ORDER BY `nama_kategori` ASC, `nama_alat` ASC, `no_inventaris` ASC, `tanggal_masuk` ASC

    public function getAlatLabBaikStok($kondisi = 'Baik')
    {
        $builder = $this->db->table('simlab_alat_laboratorium');
        $builder->select('simlab_alat_laboratorium.*, simlab_kategori.*, simlab_ruang_laboratorium.*');
        $builder->join('simlab_kategori', 'simlab_kategori.id_kategori = simlab_alat_laboratorium.id_kategori');
        $builder->join('simlab_ruang_laboratorium', 'simlab_ruang_laboratorium.id_ruang = simlab_alat_laboratorium.id_ruang');
        $builder->where('kondisi', $kondisi);
        $builder->where('stok >', 0);
        $builder->orderBy('nama_kategori', 'ASC');
        $query = $builder->get();
---
SELECT `simlab_alat_laboratorium`.*, `simlab_kategori`.*, `simlab_ruang_laboratorium`.*
FROM `simlab_alat_laboratorium`
JOIN `simlab_kategori` ON `simlab_kategori`.`id_kategori` = `simlab_alat_laboratorium`.`id_kategori`
JOIN `simlab_ruang_laboratorium` ON `simlab_ruang_laboratorium`.`id_ruang` = `simlab_alat_laboratorium`.`id_ruang`
WHERE `kondisi` = 'Baik'
AND `stok` > 0
ORDER BY `nama_kategori` ASC

    public function getStokByAlat($id_alat)
    {
        $builder = $this->db->table('simlab_alat_laboratorium');
        $builder->select('simlab_ruang_laboratorium.* ,simlab_alat_laboratorium.*');
        $builder->join('simlab_ruang_laboratorium', 'simlab_ruang_laboratorium.id_ruang = simlab_alat_laboratorium.id_ruang');
        $builder->where('simlab_alat_laboratorium.id_alat', $id_alat);
        $query = $builder->get();
---
SELECT `simlab_ruang_laboratorium`.*, `simlab_alat_laboratorium`.*
FROM `simlab_alat_laboratorium`
JOIN `simlab_ruang_laboratorium` ON `simlab_ruang_laboratorium`.`id_ruang` = `simlab_alat_laboratorium`.`id_ruang`
WHERE `simlab_alat_laboratorium`.`id_alat` = '727d9983-9523-4fbc-8c6c-db765009e56f'