app/Models/Tracer/CmsModel.php

    function getWarna()
    {
        $builder = $this->db->table('tracer_cms');
        $builder->select('id_cms, key, warna_bg');
        $builder->where('key', 'warna');
        $query = $builder->get();
---
SELECT `id_cms`, `key`, `warna_bg`
FROM `tracer_cms`
WHERE `key` = 'warna'