app/Controllers/LandingController.php

SELECT *
FROM `tracer_alumni_berprestasi`
---
    public function index()
    {
        $data = [
            'title' => 'Landing | Sistem Informasi Prodi D3 Teknik Informatika Madiun',
            'page' => 'Home',
            'cms' => $this->cms->getWarna(),
            'faq' => $this->faq->findAll(),
            'alumni_berprestasi' => $this->alumni_berprestasi->findAll(),