app/ThirdParty/MythAuth/src/Models/GroupModel.php

SELECT `auth_groups_users`.*, `auth_groups`.`name`, `auth_groups`.`description`
FROM `auth_groups`
LEFT JOIN `auth_groups_users` ON `auth_groups_users`.`group_id` = `auth_groups`.`id`
WHERE `user_id` = 34
---
    public function getGroupsForUser(int $userId)
    {
        if (null === $found = cache("{$userId}_groups")) {
            $found = $this->builder()
                ->select('auth_groups_users.*, auth_groups.name, auth_groups.description')
                ->join('auth_groups_users', 'auth_groups_users.group_id = auth_groups.id', 'left')
                ->where('user_id', $userId)
                ->get()->getResultArray();

SELECT `id`
FROM `auth_groups`
WHERE `name` = 'mahasiswa'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `auth_groups_users`
WHERE `user_id` = '34'
AND `group_id` = '2'
---
    public function inGroup($groupSlug, $userId)
    {
        // Ambil ID grup berdasarkan slug grup
        $group = $this->db->table('auth_groups')
                          ->select('id')
                          ->where('name', $groupSlug)
                          ->limit(1)
                          ->get()
                          ->getRow();

        // Jika grup ditemukan, lakukan pengecekan di tabel penghubung
        if ($group) {
            $groupId = $group->id;

            // Cek apakah pengguna masuk dalam grup berdasarkan ID grup dan ID pengguna
            $groupUser = $this->db->table('auth_groups_users')
                                  ->where('user_id', $userId)
                                  ->where('group_id', $groupId)
                                  ->countAllResults();